app/controllers/bankinformations_controller.rb

SELECT "bankinformations".* FROM "bankinformations"
---
  def index
    @bankinformations = Bankinformation.all

INSERT INTO "bankinformations" ("bankname", "accountnumber", "routingnumber", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["bankname", "GTBBANK"], ["accountnumber", 457895496], ["routingnumber", "5478964875"], ["created_at", "2020-05-13 22:26:08.833730"], ["updated_at", "2020-05-13 22:26:08.833730"], ["user_id", 1]]
---
  def create
    @bankinformation = Bankinformation.new(bankinformation_params)

    if @bankinformation.save