app/controllers/billexpenses_controller.rb

SELECT "billexpenses".* FROM "billexpenses"
---
  def index
    @billexpenses = Billexpense.all

SELECT "billexpenses".* FROM "billexpenses" WHERE "billexpenses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_billexpense
      @billexpense = Billexpense.find(params[:id])