app/controllers/creditcards_controller.rb

SELECT "creditcards".* FROM "creditcards"
---
  def index
    @creditcards = Creditcard.all